code/security-ws/output/ws-securitypolicy/username-timestamp-signencrypt-response.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security
                xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                soap:mustUnderstand="1">
            <wsu:Timestamp wsu:Id="TS-a7f10aaa-5ff1-4d62-a59a-87f5ef624bf1">
                <wsu:Created>2016-04-20T13:26:38.874Z</wsu:Created>
                <wsu:Expires>2016-04-20T13:31:38.874Z</wsu:Expires>
            </wsu:Timestamp>
            <xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
                <xenc:DataReference URI="#ED-2e5078c7-3a68-4419-b37c-44116abf68c5"/>
            </xenc:ReferenceList>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
                          Id="SIG-860dd0d9-7c37-458b-8d82-ef76ba50b0b7">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                                PrefixList="soap"/>
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
                    <ds:Reference URI="#TS-a7f10aaa-5ff1-4d62-a59a-87f5ef624bf1">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                                        PrefixList="wsse soap"/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>WAda8tW0/0HLKlLjdzc1jcZfCZA=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#_e19c54d1-2c9a-4869-a993-829121317e24">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                                        PrefixList=""/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>zPFAEBx1bXAlYkJHMCnqmeIyuts=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>ZY4ZDWX3JemJi0DF6AXvA/lw4oI=</ds:SignatureValue>
                <ds:KeyInfo Id="KI-c50c6d9d-4160-4238-8226-9dac775cb346">
                    <wsse:SecurityTokenReference
                            xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
                            wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"
                            wsu:Id="STR-d0fd89e6-c462-4932-bed4-7321f0ec1126">
                        <wsse:KeyIdentifier
                                EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
                                ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1">
                            3+s+xuqaosUsQTti7CZIw1V2Vac=
                        </wsse:KeyIdentifier>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
               wsu:Id="_e19c54d1-2c9a-4869-a993-829121317e24">
        <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
                            Id="ED-2e5078c7-3a68-4419-b37c-44116abf68c5"
                            Type="http://www.w3.org/2001/04/xmlenc#Content">
            <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <wsse:SecurityTokenReference
                        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                        xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
                        wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
                    <wsse:KeyIdentifier
                            EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
                            ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1">
                        3+s+xuqaosUsQTti7CZIw1V2Vac=
                    </wsse:KeyIdentifier>
                </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
                <xenc:CipherValue>
                    CBfUuEV0/BO9imdDWyuuxzYBJJPbqbF/g0lA59BrbKTxIloV+5kPD0jr7jmouce+MyK2SnVcjk0ZQN0YJ/FpvumNIETEaSwTlXzbDkS5TJh/5+Pc5DWmpOtCrZcqtgffht9BuGE3p4SE2Z+ziHWMxgmmUotSpE9WS+SRGypy82jqNv/ewJ5q0gZ4m6H2Aomt
                </xenc:CipherValue>
            </xenc:CipherData>
        </xenc:EncryptedData>
    </soap:Body>
</soap:Envelope>
